#define _CART_SECURE_NO_WARNINGS
#include<stdio.h>
//操作符

////算术操作符：+ - * / %（余数） ++ --
//int main() {
//	int a = 9 / 2;//整型除以整型，结果是整型，取整
//	float b = 9 / 2;//整型除以整型，结果是整型，取整后再转为浮点型
//	float c = 9 / 2.0;//整型除以浮点型，结果是浮点型
//	int d = 9 % 2;//取余数
//	printf("%d %f %f %d", a,b,c,d);
//	return 0;
//}

////移位操作符：<< >>（箭头指哪往哪移）
//int main() {
//	int a= 5;
//	int b = a << 1;//左移1位,相当于乘以二，原理为二进制位向左移动一位，低位补0
//	printf("%d\n",b);
//	int c = a >> 1;//右移1位,相当于除以二，原理为二进制位向右移动一位，高位补0
//	printf("%d",c);
//	return 0;
//}

//位指示符； &（安慰与） |（按位或） ^（按位异或）

//赋值操作符：= += -= *= /= %= <<= >>= &= |= ^=
//int main() {
//	int a = 5;
//	int b,c,d,e;
//	a = a + 2;//普通赋值
//	a += 2;//复合赋值，相当于b=b+2
//	
//	b=b-2;//普通赋值
//	b -= 2;//复合赋值，相当于b=b-2
//
//	//...
//	return 0;
//
//}


////单目操作符：-（取反） !（逻辑非） ~（按位取反） &（取地址） *（取值） sizeof（计算数据类型或变量的大小，单位是字节）
//int main() {
//	int a = 10;
//	printf("%d\n", -a);//取反(负数)
//	printf("%d\n", !a);//逻辑非 0为假 非零数为真(非零为真，取反为假，结果为0)
//	
//	if (a)
//	{
//		//a如果为非零数（真），条件成立
//	}
//
//	if (!a)
//	{
//		//a如果为零（假），条件成立
//	}
//	//sizeof是一种操作符！！！不是函数
//	printf("%d\n", sizeof( int ));//计算int类型的大小
//
//	int arr[10] = { 0 };
//	printf("%d\n", sizeof arr);//数组arr所占的大小，4个int类型数据，占40个字节4*10=40
//	//计算arr数组的大小;sizeof后面可以跟数据类型，也可以跟变量名，跟变量名时可以不用加小括号
//	printf("%d\n", sizeof arr[0]);//计算arr数组第一个元素的大小
//	int sz = sizeof arr / sizeof arr[0];//计算数组元素个数
//	printf("数组元素个数为:%d\n", sz);
//	printf("%d\n", ~a);//按位取反二进制位，把所有（包括符号位）二进制中的数字，1变0，0变1，整数在内存中是以补码形式存储的
//	//从数学角度看，~x 等价于 - x - 1，这也是为什么~10的结果是 - 11。
//	//一个整数在二进制表示有3种形式：原码，反码，补码，正数的原码，反码，补码都一样，负数的反码=原码符号位（第一位1为负数，0为正数）不变，其余位取反，负数的补码=反码+1
//	printf("%p\n", &a);//取地址操作符，取变量a的地址
//	
//	return 0;
//

//--前置与后置 ++前置与后置 *间接访问操作符 (类型)强制类型转换
//int main() {
//	int a = 10;
//	int b = ++a;
//	printf("a=%d b=%d\n", a, b);//a=11 b=11,先给a加1，再赋值给b
//	int c = 5;
//	int d=--c;
//	printf("a=%d c=%d\n", c, d);//a=4 c=4,先给c减1，再赋值给d
//	//强制类型转换
//	int e = 3.14;//隐式转换，编译器自动把3.14转换为整型3
//	int f = (int)3.14;//显式转换，强制把3.14转换为整型3
//	printf("e=%d f=%d\n", e, f);
//	return 0;
//}

//关系操作符：> < >= <= == !=

//逻辑操作符：&&（逻辑与） ||（逻辑或）
//int main() {
//	int a = 10;
//	int b = 20;
//	int c = a && b;
//	int d = 0;
//	int e = a && d;
//	int f = a || b;
//	int g = a || d;
//	printf("%d\n", c);//结果为1，非零即为真，真与真结果为真（1）
//	printf("%d\n", e);//结果为0，真与假结果为假（0）a和b都要为真，结果才为真
//	printf("%d\n", f);//结果为1，真或真结果为真（1）
//	printf("%d\n", g);//结果为1，真或假结果为真（1）a和b只要有一个为真，结果就为真
//	return 0;
//
//}

////条件操作符：？:
//int main() {
//	int a ;
//	int b ;
//	int max;
//
//	scanf("%d %d", &a, &b);
//	if(a>b) 
//		printf("max=%d\n", a);
//	else
//		printf("max=%d\n", b);
//	
//	max = a > b ? a : b;
//	printf("max=%d\n", max);
//	//两种方法实现取两个数中的最大值	
//	return 0;
//}



